[General Setting]
Language_Name=英语--English
Image_index=2
[ALL]
////////////////////////////////main/////////////////////////
IDC_STC_TITLE = Recorder
IDC_STC_SIZE = Size:
IDC_STC_TIME = Time:
IDC_STC_STATUS = Status:

IDR_MENU_TRAY_SHOWMAIN = Show Main
IDR_MENU_TRAY_START = Record
IDR_MENU_TRAY_PAUSE = Pause
IDR_MENU_TRAY_STOP = Stop
IDR_MENU_TRAY_EXIT = Exit


IDC_STATIC_TIP_RECORDDEST = Target:
IDC_STATIC_TIP_AUDIO = Audio:
IDC_STATIC_TIP_OUTPUT = Output:
IDC_STATIC_RECORDDEST_NONE = None
IDC_BUTTON_RECORD = Record
IDC_BUTTON_PAUSE = Pause
IDC_BUTTON_STOP = Stop
IDC_BUTTON_CONTINUE = Continue

IDC_STATIC_MAIN_BUY = Purchase
IDC_STATIC_MAIN_REG = Register
IDC_STATIC_MAIN_ABOUT =Guide

strCameraFormat = Camera@%s
////////////////////////////////播放器/////////////////////////
IDC_STC_PLAYER_TITLE = Media Players
IDR_MENU_PLAYER_OPENFILE = Open File
IDR_MENU_PLAYER_PLAY = Play
IDR_MENU_PLAYER_PAUSE =Pause
IDR_MENU_PLAYER_STOP = Stop

////////////////////////////////设置/////////////////////////
IDC_STC_ADVANCEDSET_TITLE = Settings
IDC_BUTTON_SETTARGET = Target
IDC_BUTTON_SETVIDEO = Video
IDC_BUTTON_SETAUDIO = Audio
IDC_BUTTON_SETWATERMARK = Watermark
IDC_BUTTON_SETCURSOR = Cursor
ID_BUTTON_SETSCREENSHOT = Screenshot
ID_BUTTON_SETHOTKEY = Hotkey
ID_BUTTON_OK = OK
ID_BUTTON_CANCEL = Cancel

////////////////////////////////设置--视频/////////////////////////
IDC_STC_VIDEO_FOLDER = Folder:
IDC_STC_VIDEO_RECORDREGION = Region:
IDC_STC_VIDEO_QUALITY = Quality:
IDC_STC_VIDEO_FORMAT = Format:
IDC_STC_VIDEO_FRAME = FPS:
IDC_STC_VIDEO_RESOLUTION = Resolution:
IDC_STC_VIDEO_RECORDOBJECT = Object:
IDC_STATIC_VIDEO_CAMERA = Camera:
IDC_CHECK_RECORDSCREEN = Screen
IDC_CHECK_RECORDCAMERA = Screen capture and webcam at the sametime
IDC_RADIO_FULLSCREEN = Full Screen
IDC_RADIO_USERDEFINED = User-Defined
IDC_RADIO_CAMERA = Camera
IDC_COMBO_VIDEO_QUALITY_0 = Highest
IDC_COMBO_VIDEO_QUALITY_1 = Higher
IDC_COMBO_VIDEO_QUALITY_2 = Medium
IDC_COMBO_VIDEO_QUALITY_3 = Lower
IDC_COMBO_VIDEO_QUALITY_4 = Lowest
IDC_BTN_PREVIEW_OPEN = Preview
IDC_BTN_PREVIEW_CLOSE = Close
IDC_CHECK_VIDEO_HW = Enable GPU Acceleration
IDC_BUTTON_AUTORECORD = Auto Record

IDC_COMBO_VIDEO_RESOLUTION_0 = Original Size
IDC_COMBO_VIDEO_RESOLUTION_1 = Original Size 50%
IDC_COMBO_VIDEO_RESOLUTION_2 = 320 x 240
IDC_COMBO_VIDEO_RESOLUTION_3 = 480 x 360
IDC_COMBO_VIDEO_RESOLUTION_4 = 640 x 480
IDC_COMBO_VIDEO_RESOLUTION_5 = 800 x 600
IDC_COMBO_VIDEO_RESOLUTION_6 = 1280 x 720
IDC_COMBO_VIDEO_RESOLUTION_USER = User-Defined

IDC_CHECK_TARGET_HIDECAMERA = Hide camera window when recording
IDC_CHECK_TARGET_HOTSHOT = Zoom In while recording
IDC_STATIC_TARGET_SCALE = Scale:
IDC_STATIC_TARGET_SCALE_FORMAT = %0.1f 
IDC_STATIC_TARGET_HOTKEY_TIP = Open/Close Hotkey：

IDC_STATIC_USERDEFINEDPARAM_TITLE = User-defined
IDC_STATIC_USERDEFINEDPARAM_DES1 = New Resolution:
IDC_STATIC_USERDEFINEDPARAM_DES2 = New FPS:
IDC_STATIC_USERDEFINEDPARAM_TIP1 = Video width can't be empty!
IDC_STATIC_USERDEFINEDPARAM_TIP2 = Video height can't be empty!
IDC_STATIC_USERDEFINEDPARAM_TIP3 = Video width must be greater than zero!
IDC_STATIC_USERDEFINEDPARAM_TIP4 = Video height must be greater than zero!
IDC_STATIC_USERDEFINEDPARAM_TIP5 = Video frame rate can't be empty!
IDC_STATIC_USERDEFINEDPARAM_TIP6 = Video frame rate must be greater than zero!
IDC_STATIC_USERDEFINEDPARAM_TIP7 = Video frame rate can't be greater than 40!

IDC_CHECK_TARGET_TRANS = Record Transparent and Layered Windows
IDC_STATIC_TARGET_TRANS = When this option is checked, transparent/layered windows displayed on the screen will be recorded. Since this option may slow down the recording, it should be used only when needed.

////////////////////////////////设置--音频/////////////////////////
IDC_STC_AUDIO_DEVICE = Source:
IDC_STC_AUDIO_QUALITY = Quality:
IDC_COMBO_AUDIO_QUALITY_0 = High
IDC_COMBO_AUDIO_QUALITY_1 = Middle
IDC_COMBO_AUDIO_QUALITY_2 = Low

////////////////////////////////设置--水印/////////////////////////
IDC_BUTTON_WATERMARK_TAB_TEXT = Text Watermark
IDC_BUTTON_WATERMARK_TAB_IMAGE = Image Watermark
IDC_STATIC_TEXTWATERMARK_TRANSPARENT = Transparency:
IDC_STATIC_TEXTWATERMARK_ROTATE = Rotate:
IDC_STATIC_TEXTWATERMARK_ALIGNMENT = Alignment:
IDC_STATIC_TEXTWATERMARK_ALIGNMENT_X = X：
IDC_STATIC_TEXTWATERMARK_ALIGNMENT_Y = Y：
IDC_CHECK_TEXTWATERMARK_SCROLL = Enable Scrolling
IDC_STATIC_TEXTWATERMARK_DIRECT = Scrolling direct
IDC_STATIC_TEXTWATERMARK_SIZE = Scrolling size
IDC_STATIC_TEXTWATERMARK_TIME = Scrolling duration
IDC_CHECK_TEXTWATERMARK_FADEIN = Fade in
IDC_CHECK_TEXTWATERMARK_FADEOUT = Fade out
IDC_CHECK_TEXTWATERMARK_REPEAT = Repeat
IDC_BUTTON_ADD_TEXTWATERMARK = Add
IDC_BUTTON_TEXTWATERMARK_FONT = Font
IDC_BUTTON_TEXTWATERMARK_PREVIEW = Preview

IDC_STATIC_IMAGEWATERMARK_SCALE = Scale:
IDC_STATIC_IMAGEWATERMARK_SCALE_WIDTH = Width:
IDC_STATIC_IMAGEWATERMARK_SCALE_HEIGHT = Height:
IDC_STATIC_IMAGEWATERMARK_ROTATE = Rotate:
IDC_STATIC_IMAGEWATERMARK_FILEPATH = File：
IDC_STATIC_WATERMARKPREVIEW_TITLE = Preview

IDC_BUTTON_WATERMARK_CLEAR = Clear
IDC_CHECK_TEXTWATERMARK = Enable this watermark
IDC_COMBO_TEXTWATERMARK_DIRECT_0 = Horizontal
IDC_COMBO_TEXTWATERMARK_DIRECT_1 = Vertical

IDC_STATIC_WATERMARK_DES1 = No Watermark
IDC_STATIC_WATERMARK_DES2 = Please add watermark

IDC_STATIC_IMAGEWATERMARK_IMAGE = Image:

////////////////////////////////设置--水印-Font/////////////////////////
IDC_STATIC_FONT_TITLE = Font
IDC_STATIC_FONT_NAME = Name：
IDC_STATIC_FONT_SIZE = Size：
IDC_STATIC_FONT_COLOR = Color：
IDC_STATIC_FONT_DISTANCE = Spacing:
IDC_CHECK_FONT_SHADOW = Enable Shadow
IDC_CHECK_FONT_STROKE = Enable Stroke
IDC_CHECK_FONT_GLOWOUT = Enable Glowout
IDC_BUTTON_FONT_OK = OK
IDC_BUTTON_FONT_CANCEL = Cancel


////////////////////////////////设置--鼠标/////////////////////////
IDC_CHECK_CURSOR_RECORD = Embed mouse cursor in recording.
IDC_CHECK_CURSOR_SCREENSHOT = Embed mouse cursor in screenshots.
IDC_CHECK_CURSOR_SOUND = Mouse click sound effect.
IDC_CHECK_CURSOR_CLICKEFFECT = Mouse click effect:
IDC_STATIC_CURSOR_LEFTTIP = Left click:
IDC_STATIC_CURSOR_RIGHTTIP = Left double click:

////////////////////////////////设置--截图/////////////////////////
IDC_STATIC_SCREENSHOT_FORMAT = File Format:
IDC_STATIC_SCREENSHOT_OUTPUT = Output Folder:
IDC_CHECK_SCREENSHOT_CLICK = Take screenshot when mouse click
IDC_CHECK_SCREENSHOT_TIME = every
IDC_STATIC_SCREENSHOT_TIME = seconds
IDC_CHECK_SCREENSHOT_SOUND = Shutter sound

////////////////////////////////设置--快捷键/////////////////////////
//suker
IDC_BUTTON_AUDIO_ADVANCED = Advanced

////////////////////////////////摄像头预览/////////////////////////
IDC_STATIC_CAMERAPREVIEW_TITLE = Preview - %s
IDS_OPEN_CAMERA_FAILED = Failed to open the camera!

////////////////////////////////设置--常规/////////////////////////
IDC_CHECK_DEFAULTRECORDSIZE = 录制范围默认尺寸
IDC_CHECK_MINWINDOW = 录制时最小化窗口
IDC_CHECK_OPENFILE = 录制完成后直接打开文件
IDC_STC_COMMON_CLOSEAPP = 关闭程序时：
IDC_RADIO_CLOSETO_TRAY = 最小化到托盘
IDC_RADIO_CLOSETO_EXIT = 退出程序
IDC_COMBO_DEFAULTRECORDSIZE_0 = 400x300
IDC_COMBO_DEFAULTRECORDSIZE_1 = 640x480
IDC_COMBO_DEFAULTRECORDSIZE_2 = 720x480
IDC_COMBO_DEFAULTRECORDSIZE_3 = 800x600
IDC_COMBO_DEFAULTRECORDSIZE_4 = Full Screen

////////////////////////////////设置--高级/////////////////////////
IDC_STC_ADVANCED_HOTKEY = Hotkey:
IDC_STC_ADVANCED_RECORD = Start:
IDC_STC_ADVANCED_PAUSE  = Pause:
IDC_STC_ADVANCED_STOP   = Stop:
IDC_STC_ADVANCED_SCREENSHOT   = Screenshot:
IDC_STC_ADVANCED_NOTE   = 添加注释：
IDC_CHECK_NOTE_TIME     = 时间/日期注释
IDC_CHECK_NOTE_WATERMARK= 添加水印
IDC_CHECK_NOTE_TITLE    = 标题注释

////////////////////////////////录制范围设置界面/////////////////////////
IDC_STC_AREAHELPER_TITLE = Area
IDC_STATIC_WIDTH = Width:
IDC_STATIC_HEIGHT = Height:
IDC_BUTTON_HELPER_RECORD = Record

////////////////////////////////图片列表/////////////////////////
IDC_BUTTON_BROWSERIMAGE_LOAD = Load Watermark
IDC_BUTTON_BROWSERIMAGE_DELETE = Delete
IDC_BUTTON_BROWSERIMAGE_OK = OK
IDC_BUTTON_BROWSERIMAGE_CANCEL = Cancel
IDC_BUTTON_BROWSERIMAGE_TITLE = Browse
IDC_BUTTON_BROWSERIMAGE_DES = Click "Load Watermark" button add your own watermark or select existing watermark.


////////////////////////////////提示信息/////////////////////////
IDS_PLAYER_FILTER = Video Files|*.avi;*.mp4;*.wmv;*.mpg;*.swf|All Files (*.*)|*.*||
IDS_RECORD_FAILED = Start record failed! Error code:%d
IDS_CREATEDIR_FAILED = Can not create folder: %s ，please reset!
IDS_FOLDER_ERRORNAME = Specify a wrong folder name. Folder name can not contain any of the following characters: * <> "/ |?
IDS_FOLDER_TIP1 = Folder %s does not exists. 
IDS_FOLDER_TIP2 = To create it?
IDS_SELECT_FOLDER = Select output folder
IDS_IMAGEWATERMARK_FILTER = All Picture(*.jpg;*.png;*.png;*.gif)|*.jpg;*.png;*.bmp;*.gif|


IDS_RECORD_START = Starting recording ...

//suker
IDS_RECORD_RECORDING = Recording ...
IDS_RECORD_PAUSE = Paused
IDS_RECORD_READY = Ready

IDS_AUDIO_DEVICE_MIX_MIC =  Computer sounds and microphone
IDS_AUDIO_DEVICE_MIX = Computer sounds
IDS_AUDIO_DEVICE_MIC = Microphone
IDS_AUDIO_DEVICE_NONE = None

IDS_CLOSEAPP_WHEN_RECORD = It's recording now, are you sure to stop?
IDS_HOTKEY_REDEFINE = The key [%s] has been set, please set the other keys.
IDS_VOLUME = Volume
IDS_NO_CAMERADEVICE = The software does not detect the camera, make sure the camera has been installed successfully!
IDS_INIT_CAMERA_FAILED = Failed to initialize the camera!
IDS_PLAYER_TITLE = Video Player %s

[ImageListTabName]
Protection = Protection
Business = Business
Love = Love
Festival = Festival
Icon = Icon
Feature = Feature
Digital = Digital
Cute = Cute
Life = Life
User = User



[Tips]
m_btnOutput = Open output folder
m_btnSetOutput = Set output folder
m_btnStartRecord = Start recording
m_btnSetRegionType = Set Region
m_btnPlay = Play
m_btnPause = Pause
m_btnStop = Stop
m_btnSettings = Settings
m_btnChangeLang = Change Language
m_btnAudio = Audio Device
m_btnCamera_Open = Click to open the camera
m_btnCamera_Close = Click to close the camera
m_btnClose = Close
strHasTmpWatermark = You have not saved watermark, add now?
strInvalidImage = Invalid image file!
strTrial = 
strFamilyLicense = Family License
strWatermark1 = 
strWatermark2 = www.thundershare.net
strWatermark3 = 
strConfigPath = \ThunderSoft\Free Screen Recorder\
strClearTip = Are you sure to clear all watermark?

[ErrorCode]
0001 = Not Found encoders, recording failed!
0002 = Initialize encoder abnormal recording failed!
0003 = Start encoder abnormal recording failed!
0004 =  Parameter error, recording failed!
0005 = Internal error, recording failed!

[frmReg]
lblTitle = Software Registration
lblDescription1 =  ThunderSoft Screen Recorder trial version, when recording screen will appear unregistered watermark. Purchased registration code remove the restriction.
lblDescription2 =   Check the registration Email sent from us for Register Name and Register Code after purchase.
lblDescription3 =One time  payment, Lifetime Upgrades FREE!
lblDescription3_1 = Click  
lblDescription3_2 = button to remove any limitation.
btnBuy = Buy Now!
btnReg = Register
btnEvaluate = Evaluate

lblUserName = Contact Email:
lblkey = Register Code:
lblProblem = Please fee free to contact us:

strNoKey =  Please enter your register key!
strNoName = Please enter your contact email!
strErrorEmail = Your email format is not corrent. please enter again!
strRegSuccess =Upgrade to registered version successfully.
strRegToName = This software is registered to %s
strRegFailed = Failed to upgrade to full version.
strErrorKeyLength = Invalid regcode length.
strRegFailedReason1 = Invalid product code.
strRegFailedReason2 = Failed to initialize register.
strRegFailedReason3 = Failed to register product.
strRegFailedReason4 = Failed to active this product,the registration code can not be verified through the network!
strInvalidKey = The registration code can not be verified through the network,please purchase it to get valid key.
strKeyBeDeleted = We detected that your registration information has been deleted, please contact us and re-register the software!
support=Contact technical support team

[frmRegTip]
lblTitle=Register Tip
lblDes1_1=Failed to register,the register code entered can only be used on 1 PC.
lblDes1_2=Failed to register,the register code entered can only be used on 3 PCs.
lblDes2=Now you have two ways to solve this problem:
lblBuy=1.  Buy another register code to authorize the PC.
lblActive=2. Deauthorize the register code on other PCs,then authorize the PC.
lblEmail=Registration Code:
btnBuy=Buy Now!
btnActive=Continue
btnOK=Close
strActiveFailed=Failed to authorize the PC,please enter the correct register code!
lblTip1=
lblTip2=

[frmGetNewVersion]
Title = The latest version has been released.
btnUpdate = Upgrade Now
btnCancel = Remind Me Later
HasNewVerson = A new version (%s) has been released!
VersionTip = We are excited to announce a new version of %s with a new set of features.Using the latest version can be a better experience,please click 'Upgarde Now' button to download it.
FreeVersionTip = We are excited to announce a new version of %s with a new set of features.Using the latest version can be a better experience,please click 'Upgarde Now' button to download it.

[frmAbout]
Type = 1
About = About
version= Version:
VersionNumber = 6.3.0
copyright=Copyright (C) 2016 ThunderSoft. All Rights Reserved.
homePage= Visit the home page of this product
lblRegTo=Registered to:
support= Contact technical support team
btnOK = OK
lblDes = Warning: This computer program is protected by copyright law and international treaties.Unauthorized reproduction or distribution may result in severe civil and criminal penalties,and will be prosecuted to the maximum extent possible under the law.


[Product]
Company Name = ThunderSoft
CompanyHomePage = http://www.thundershare.net/free-screen-recorder/
Product short Name = Free Screen Recorder
Product long Name = Free Screen Recorder
ProductHomePage = http://www.thundershare.net/free-screen-recorder/
ProductHelpPage = http://www.thundershare.net/free-screen-recorder/
PurchaseURL = http://www.thundershare.net/screen-recorder/buy.html
BuyNowURL = http://www.thundershare.net/screen-recorder/buy.html
Support Email = thundersoftsupport@gmail.com